practice-for-ch-rails-art-share-api-long-practice-main/art_share/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jordy"], ["LIMIT", 1]]
---
  def index
    if !params.has_key?(:username)
      users = User.all
      render json: users
    else
      user = User.find_by!(username: params[:username])

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "jordy"], ["created_at", "2023-06-08 15:11:28.935135"], ["updated_at", "2023-06-08 15:11:28.935135"]]
---
  def create
    user = User.new(params_permit)
    if user.save